rkz/extension/Documents/ПроизводствоБезЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПроизводствоБезЗаказа</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МатериалыИРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НомерГруппыЗатрат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыходныеИзделия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НомерГруппыЗатрат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

rkz/extension/InformationRegisters/бит_СоставИсполнителейИВремяВыполнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>бит_СоставИсполнителейИВремяВыполнения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЧасыНорма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЧасыФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Смена</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СменноеЗадание</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Бригада</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Бригады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументПроизводства</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Разряд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазрядыКатегорииДолжностей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Начисление</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

rkz/extension/Enums/ЕдиницыИзмеренияВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЕдиницыИзмеренияВремени</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Минута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Час</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сутки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Секунда</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

rkz/extension/Documents/ПроизводствоБезЗаказа/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.37]  [VUVaynula@1cbit.ru] [26.05.2025 2:02:31] +        
	НоваяКоманда = ЭтаФорма.Команды.Добавить("бит_АтрибутыТары");
	НоваяКоманда.Заголовок = "Атрибуты тары";
	НоваяКоманда.Действие = "бит_АтрибутыТары";
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("бит_АтрибутыТары", Тип("КнопкаФормы"), Элементы.ВыходныеИзделия.КоманднаяПанель);
	НовыйЭлемент.Заголовок = "Атрибуты тары";
	НовыйЭлемент.ИмяКоманды = "бит_АтрибутыТары";
	// }}ПервыйБИТ ЛистТребований [ЛТ5.37]  [VUVaynula@1cbit.ru] [26.05.2025 2:02:31] -
	
	
	// {{ПервыйБИТ ЛистТребований [ЛТ6.1.4] [ASHolyavko@1cbit.ru] [24.09.2025] +        
	
	НоваяСтраница = Этаформа.Элементы.Вставить("бит_СтраницаСоставБригады", Тип("ГруппаФормы"), ЭтаФорма.Элементы.ГруппаСтраницы, Элементы.ГруппаДополнительно);
	НоваяСтраница.Вид = ВидГруппыФормы.Страница;
	НоваяСтраница.Заголовок = "(бит) Должности и типы начислений";
	НоваяСтраница.ПутьКДаннымЗаголовка = "Объект.бит_СоставБригады.КоличествоСтрок";
	//НоваяСтраница.Видимость = ТипЗнч(Объект.бит_Исполнитель) = Тип("СправочникСсылка.Бригады");
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_СоставБригады", Тип("ТаблицаФормы"), НоваяСтраница, Неопределено);
	НовыйЭлемент.ПутьКДанным = "Объект.бит_СоставБригады";
	НовыйЭлемент.АвтоВводНовойСтроки = Ложь;
	НовыйЭлемент.ВысотаВСтрокахТаблицы = 6;
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Верх;
	НовыйЭлемент.УстановитьДействие("ПриНачалеРедактирования", "бит_СоставБригадыПриНачалеРедактирования");	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыработкаСотрудниковВидыРабот.Распоряжение КАК Распоряжение
		|ИЗ
		|	Документ.ВыработкаСотрудников.ВидыРабот КАК ВыработкаСотрудниковВидыРабот
		|ГДЕ
		|	ВыработкаСотрудниковВидыРабот.Распоряжение = &Распоряжение
		|	И ВыработкаСотрудниковВидыРабот.Ссылка.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыработкаСотрудниковВидыРабот.Распоряжение";
	
	Запрос.УстановитьПараметр("Распоряжение", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	НовыйЭлемент.Доступность = ВыборкаДетальныеЗаписи.Количество() = 0;	
		
	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_СоставБригадыСотрдуник", Тип("ПолеФормы"), ЭтаФорма.Элементы.бит_СоставБригады, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_СоставБригады.Сотрудник";
	НовыйЭлемент.УстановитьДействие("НачалоВыбора", "бит_СоставБригадыСотрудникНачалоВыбора");
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_СоставБригадыКодОперации", Тип("ПолеФормы"), ЭтаФорма.Элементы.бит_СоставБригады, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_СоставБригады.КодОперации";
	НовыйЭлемент.БыстрыйВыбор = Ложь;
	НовыйЭлемент.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
	НовыйЭлемент.УстановитьДействие("НачалоВыбора", "бит_СоставБригадыКодОперацииНачалоВыбора");
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_СоставБригадыДолжность", Тип("ПолеФормы"), ЭтаФорма.Элементы.бит_СоставБригады, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_СоставБригады.Должность";
	НовыйЭлемент.БыстрыйВыбор = Ложь;
	НовыйЭлемент.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
	НовыйЭлемент.УстановитьДействие("НачалоВыбора", "бит_СоставБригадыДолжностьНачалоВыбора");
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_СоставБригадыРазряд", Тип("ПолеФормы"), ЭтаФорма.Элементы.бит_СоставБригады, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_СоставБригады.Разряд";
	НовыйЭлемент.БыстрыйВыбор = Ложь;
	НовыйЭлемент.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
	НовыйЭлемент.УстановитьДействие("НачалоВыбора", "бит_СоставБригадыРазрядНачалоВыбора");
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_СоставБригадыНачисление", Тип("ПолеФормы"), ЭтаФорма.Элементы.бит_СоставБригады, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_СоставБригады.Начисление";
	НовыйЭлемент.БыстрыйВыбор = Ложь;
	НовыйЭлемент.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
	НовыйЭлемент.УстановитьДействие("НачалоВыбора", "бит_СоставБригадыНачислениеНачалоВыбора");
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_СоставБригадыНачислениеКод", Тип("ПолеФормы"), ЭтаФорма.Элементы.бит_СоставБригады, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "Код начисления";
	НовыйЭлемент.ПутьКДанным = "Объект.бит_СоставБригады.Начисление.Код";
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_СоставБригадыВремяФакт", Тип("ПолеФормы"), ЭтаФорма.Элементы.бит_СоставБригады, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_СоставБригады.ВремяФакт";
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_СоставБригадыЕдиницаИзмерения", Тип("ПолеФормы"), ЭтаФорма.Элементы.бит_СоставБригады, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_СоставБригады.ЕдиницаИзмерения";
	
	
	МассивВыбора = Новый Массив;
	МассивВыбора.Добавить(Перечисления.ЕдиницыИзмеренияВремени.Минута);
	МассивВыбора.Добавить(Перечисления.ЕдиницыИзмеренияВремени.Час);
	МассивВыбора.Добавить(Перечисления.ЕдиницыИзмеренияВремени.День);
	
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", МассивВыбора);
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	
	НовыйЭлемент.ПараметрыВыбора = НовыеПараметры;
		
	// }}ПервыйБИТ ЛистТребований [ЛТ6.1.4] [ASHolyavko@1cbit.ru] [24.09.2025] -
		
	// {{ПервыйБИТ ЛистТребований [ЛТ6.1.5] [ASHolyavko@1cbit.ru] [24.09.2025] +        
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_Исполнитель", Тип("ПолеФормы"), Элементы.ГруппаОсновное, Элементы.Комментарий);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_Исполнитель"; 
	НовыйЭлемент.УстановитьДействие("НачалоВыбора", "бит_ИсполнительНачалоВыбора");
	                                
	//НовыйЭлемент = Этаформа.Элементы.Вставить("бит_Основания", Тип("ПолеФормы"), Элементы.ШапкаЛево, Элементы.ГруппаНомерДата);
	//НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	//НовыйЭлемент.Гиперссылка = Истина;
	//НовыйЭлемент.ПутьКДанным = "Объект.бит_Основания";
	//НовыйЭлемент.Заголовок = "(бит) Основание";
	////НовыйЭлемент.ТолькоПросмотр = Истина; 
	//НовыйЭлемент.Видимость =  ЗначениеЗаполнено(Объект.бит_Основания);
		
	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_Оборудование", Тип("ПолеФормы"), Элементы.ГруппаОсновное, Элементы.Комментарий); 
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	НовыйЭлемент.ПутьКДанным = "Объект.бит_Оборудование";
		
	НоваяСтраница = Этаформа.Элементы.Вставить("бит_ГруппаОперации", Тип("ГруппаФормы"), ЭтаФорма.Элементы.ГруппаСтраницы, Элементы.ГруппаМатериалыИРаботы);
	НоваяСтраница.Вид = ВидГруппыФормы.Страница;
	НоваяСтраница.Заголовок = "(бит) Операции";
	НоваяСтраница.ПутьКДаннымЗаголовка = "Объект.бит_Операции.КоличествоСтрок";
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_Операции", Тип("ТаблицаФормы"), Этаформа.Элементы.бит_ГруппаОперации, Неопределено);
	НовыйЭлемент.ПутьКДанным = "Объект.бит_Операции";
	НовыйЭлемент.АвтоВводНовойСтроки = Ложь;
	НовыйЭлемент.ВысотаВСтрокахТаблицы = 6;
	НовыйЭлемент.Отображение = ОтображениеТаблицы.Список;
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Верх;
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_ОперацииГруппаЗатрат", Тип("ПолеФормы"), ЭтаФорма.Элементы.бит_Операции, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_Операции.ГруппаЗатрат";
	НовыйЭлемент.КнопкаВыбора = Истина;
	НовыйЭлемент.УстановитьДействие("НачалоВыбора", "ОперацииГруппаЗатратНачалоВыбора");
	
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_ОперацииОперация", Тип("ПолеФормы"), ЭтаФорма.Элементы.бит_Операции, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_Операции.Операция";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "ОперацияПриИзменении");
	//Кнопка
	Команда = ЭтаФорма.Команды.Добавить("бит_Выполнено");
	Команда.Действие = "бит_ВыполненоНажатие";
	Команда.Заголовок = "(бит) Выполнено";
	Команда.Подсказка = "(бит) Выполнено";
	
	//Добавляем новую кнопку
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("бит_Выполнено", Тип("КнопкаФормы"), ЭтаФорма.КоманднаяПанель);
	НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	НовыйЭлемент.Заголовок = "(бит) Выполнено";
	НовыйЭлемент.ИмяКоманды = "бит_Выполнено";
    НовыйЭлемент.Отображение = ОтображениеКнопки.Картинка;
	НовыйЭлемент.Картинка = БиблиотекаКартинок.ВыполнитьЗадачу;   
	
	//НовыйЭлемент.УстановитьДействие("ПриИзменении", "бит_ВыполненоПриИзменении"); 	
	НовыйЭлемент.Пометка = Объект.бит_Выполнено; 	
	НовыйЭлемент.ЦветФона = ?(Объект.бит_Выполнено, WebЦвета.БледноЗеленый, Новый Цвет(255,255,255));
	
	Если НЕ Объект.бит_Выполнено Тогда
		
		Элементы.ГруппировкаЗатрат.РежимВыбораИзСписка = Истина;
		
		Элементы.ГруппировкаЗатрат.СписокВыбора.Очистить();
		
		мСписокВыбора = Новый Массив;
		мСписокВыбора.Добавить(Перечисления.ГруппировкиЗатратВПроизводствеБезЗаказа.ПоПродукции);
		мСписокВыбора.Добавить(Перечисления.ГруппировкиЗатратВПроизводствеБезЗаказа.ПоПродукцииИНазначениям);
		
		Элементы.ГруппировкаЗатрат.СписокВыбора.ЗагрузитьЗначения(мСписокВыбора);
		
	КонецЕсли;
	
	//Кнопка
	//Команда = ЭтаФорма.Команды.Добавить("бит_ЗаполнитьСоставБригады");
	//Команда.Действие = "бит_ЗаполнитьСоставБригады";
	//Команда.Заголовок = "(бит) Заполнить состав бригады";
	//
	////Добавляем новую кнопку
	//НовыйЭлемент = ЭтаФорма.Элементы.Добавить("бит_ЗаполнитьСоставБригады", Тип("КнопкаФормы"), ЭтаФорма.Элементы.бит_СоставБригадыКоманднаяПанель);
	//НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	//НовыйЭлемент.Заголовок = "(бит) Заполнить состав бригады";
	//НовыйЭлемент.ИмяКоманды = "бит_ЗаполнитьСоставБригады";

	
	// }}ПервыйБИТ ЛистТребований [ЛТ6.1.5] [ASHolyavko@1cbit.ru] [24.09.2025] -
	
	// {{ПервыйБИТ ЛистТребований [ЛТ6.2] [ASHolyavko@1cbit.ru] [05.11.2025] +        
	
	//Кнопка
	Команда = ЭтаФорма.Команды.Добавить("бит_СформироватьНаряды");
	Команда.Действие = "бит_СформироватьНаряды";
	Команда.Заголовок = "(бит) Сформировать Наряды";
	Команда.Подсказка = "(бит) Сформировать Наряды";

	//Добавляем новую кнопку
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("бит_СформироватьНаряды", Тип("КнопкаФормы"), ЭтаФорма.КоманднаяПанель);
	НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	НовыйЭлемент.Заголовок = "(бит) Сформировать Наряды";
	НовыйЭлемент.ИмяКоманды = "бит_СформироватьНаряды"; 
	НовыйЭлемент.Отображение = ОтображениеКнопки.Картинка;
	НовыйЭлемент.Картинка = БиблиотекаКартинок.ГрафикиРаботыРабочихЦентров; 
   	// }}ПервыйБИТ ЛистТребований [ЛТ6.2] [ASHolyavko@1cbit.ru] [05.11.2025] -

	
КонецПроцедуры 

&НаКлиенте
Процедура бит_СоставБригадыКодОперацииНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Ссылка", ПолучитьСписокКодовОпераций(Объект.Ссылка));
 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);
	
	ОткрытьФорму("Справочник.бит_КодыОпераций.ФормаВыбора", ПараметрыФормы, Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокКодовОпераций(Смена)                                                          
	Возврат Объект.бит_Операции.Выгрузить(, "Операция").ВыгрузитьКолонку("Операция");
КонецФункции

&НаКлиенте
Процедура бит_СоставБригадыДолжностьНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Ссылка", ПолучитьСписокДолжностей(Объект.Ссылка));
 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);
	
	ОткрытьФорму("Справочник.Должности.ФормаВыбора", ПараметрыФормы, Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура бит_СоставБригадыРазрядНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Ссылка", ПолучитьСписокРазрядов(Объект.Ссылка));
 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);
	
	ОткрытьФорму("Справочник.РазрядыКатегорииДолжностей.ФормаВыбора", ПараметрыФормы, Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура бит_СоставБригадыНачислениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Ссылка", ПолучитьСписокНачислений());
 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);
	
	ОткрытьФорму("ПланВидовРасчета.Начисления.ФормаВыбора", ПараметрыФормы, Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокДолжностей(Смена)                                                          
	Возврат РегистрыСведений.бит_СоставИсполнителейИВремяВыполнения.ПолучитьСписокДолжностей(Смена);
КонецФункции

&НаСервере
Функция ПолучитьСписокРазрядов(Смена)
	Возврат РегистрыСведений.бит_СоставИсполнителейИВремяВыполнения.ПолучитьСписокРазрядов(Смена);
КонецФункции

&НаСервере
Функция ПолучитьСписокНачислений()
	Возврат РегистрыСведений.бит_СоставИсполнителейИВремяВыполнения.ПолучитьСписокНачислений();
КонецФункции

&НаКлиенте
Процедура бит_ЗаполнитьСоставБригады()
	
	бит_ЗаполнитьСоставБригадыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура бит_ЗаполнитьСоставБригадыНаСервере()
	
	Объект.бит_СоставБригады.Очистить();
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	бит_СоставИсполнителейИВремяВыполнения.Сотрудник КАК Сотрудник,
	//	|	бит_СоставИсполнителейИВремяВыполнения.ЧасыФакт КАК ЧасыФакт
	//	|ИЗ
	//	|	РегистрСведений.бит_СоставИсполнителейИВремяВыполнения КАК бит_СоставИсполнителейИВремяВыполнения
	//	|ГДЕ
	//	|	бит_СоставИсполнителейИВремяВыполнения.Смена = &Смена
	//	|	И ВЫБОР
	//	|			КОГДА &ЭтоБригада
	//	|				ТОГДА бит_СоставИсполнителейИВремяВыполнения.Бригада = &Исполнитель
	//	|						И бит_СоставИсполнителейИВремяВыполнения.Сотрудник <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	//	|			ИНАЧЕ бит_СоставИсполнителейИВремяВыполнения.ОперацияВыпуска = &ОперацияВыпуска
	//	|					И бит_СоставИсполнителейИВремяВыполнения.Сотрудник = &Исполнитель
	//	|		КОНЕЦ";
	//
	//Запрос.УстановитьПараметр("ОперацияВыпуска", Объект.Ссылка);
	//Запрос.УстановитьПараметр("ЭтоБригада", ТипЗнч(Объект.Исполнитель) = Тип("СправочникСсылка.Бригады"));
	//Запрос.УстановитьПараметр("Исполнитель", Объект.бит_Исполнитель);
	//Запрос.УстановитьПараметр("Смена", Объект.СменноеЗадание);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	НоваяСтрока = Объект.бит_СоставБригады.Добавить();
	//	НоваяСтрока.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
	//	НоваяСтрока.ВремяФакт = ВыборкаДетальныеЗаписи.ЧасыФакт;
	//	НоваяСтрока.ЕдиницаИзмерения = Перечисления.ЕдиницыИзмеренияВремени.Час;	
	//КонецЦикла;
	
	Модифицированность = Истина;
	
КонецПроцедуры

 &НаКлиенте
Процедура ОперацияПриИзменении()
	
	ТекущиеДанные = Элементы.бит_Операции.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
	
		ОперацияПриИзмененииНаСервере(ТекущиеДанные.Операция, ТекущиеДанные.ГруппаЗатрат, ТекущиеДанные.НомерГруппыЗатрат);

	КонецЕсли;

КонецПроцедуры 

&НаСервере
Процедура ОперацияПриИзмененииНаСервере(Операция, ГруппаЗатрат, НомерГруппыЗатрат)
	

	ТЗ = Объект.ВыходныеИзделия.Выгрузить();
	//ТЗ.Свернуть("Номенклатура");
	
	Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ.Номенклатура КАК Номенклатура,
		|	ТЗ.КоличествоУпаковок КАК Количество,
		|	ТЗ.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ вт_Номенклатура
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВидыРаботСотрудников.Ссылка КАК Ссылка,
		|	вт_Номенклатура.Количество КАК Количество,
		|	вт_Номенклатура.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	вт_Номенклатура КАК вт_Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыРаботСотрудников КАК ВидыРаботСотрудников
		|		ПО вт_Номенклатура.Номенклатура = ВидыРаботСотрудников.бит_Номенклатура
		|ГДЕ
		|	ВидыРаботСотрудников.бит_КодОперации = &бит_КодОперации
		|	И ВидыРаботСотрудников.бит_КодВРЦ = &бит_КодВРЦ
		|	И НЕ ВидыРаботСотрудников.ПометкаУдаления";
		
		Запрос.УстановитьПараметр("ТЗ", ТЗ);
		Запрос.УстановитьПараметр("бит_КодВРЦ", Объект.бит_Оборудование);
		Запрос.УстановитьПараметр("бит_КодОперации", Операция);		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НоваяСтрока = Объект.Трудозатраты.Добавить();
			НоваяСтрока.ВидРабот = ВыборкаДетальныеЗаписи.Ссылка;
			НоваяСтрока.Подразделение = Объект.Подразделение;
			НоваяСтрока.Количество = ВыборкаДетальныеЗаписи.Количество;
			НоваяСтрока.СтатьяКалькуляции = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.бит_СтатьиКалькуляцииФОТБезПремии, ЭтаФорма, Истина);
			НоваяСтрока.НомерГруппыЗатрат = НомерГруппыЗатрат;
			НоваяСтрока.ГруппаЗатрат = ГруппаЗатрат;
			НоваяСтрока.Исполнитель = Объект.бит_Исполнитель;
		КонецЦикла;
		
	
КонецПроцедуры
 
&НаКлиенте
Процедура ОперацииГруппаЗатратНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТаблицаГруппаЗатратНачалоВыбора("бит_Операции", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ВыполненоНажатие(Элемент)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ6.1.5] [ASHolyavko@1cbit.ru] [29.10.2025] +        
	
	Объект.бит_Выполнено = не Объект.бит_Выполнено;
	
	Модифицированность = Истина;
	
	ЭтаФорма.Элементы.бит_Выполнено.ЦветФона = ?(Объект.бит_Выполнено, WebЦвета.БледноЗеленый, Новый Цвет(255,255,255));
	ЭтаФорма.Элементы.бит_Выполнено.Пометка = Объект.бит_Выполнено; 
	
	Если Объект.бит_Выполнено Тогда
		
		Элементы.ГруппировкаЗатрат.РежимВыбораИзСписка = Ложь;
		Элементы.ГруппировкаЗатрат.СписокВыбора.Очистить();
		
	Иначе
		
		Элементы.ГруппировкаЗатрат.РежимВыбораИзСписка = Истина;
		
		Элементы.ГруппировкаЗатрат.СписокВыбора.Очистить();
		
		мСписокВыбора = Новый Массив;
		мСписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ГруппировкиЗатратВПроизводствеБезЗаказа.ПоПродукции"));
		мСписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ГруппировкиЗатратВПроизводствеБезЗаказа.ПоПродукцииИНазначениям"));
		
		Элементы.ГруппировкаЗатрат.СписокВыбора.ЗагрузитьЗначения(мСписокВыбора);
		
	КонецЕсли;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ6.1.5] [ASHolyavko@1cbit.ru] [29.10.2025] -
	
КонецПроцедуры

&НаСервере
Процедура УстановитьИсполнителяВТрудозатратах()
	
	Для Каждого СтрокаТЧ Из Объект.Трудозатраты Цикл
		СтрокаТЧ.Исполнитель = Объект.бит_Исполнитель;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура бит_АтрибутыТары(Команда)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.37]  [VUVaynula@1cbit.ru] [26.05.2025 2:05:37] +        
	ИмяТЧ = "ВыходныеИзделия";
	ИмяТЧСерии = "ВыходныеИзделияСерии";
	
	ТД = Элементы[ИмяТЧ].ТекущиеДанные;
	Если ТД <> Неопределено Тогда
		ПФ = Неопределено;
		Если ЗначениеЗаполнено(ТД.Серия) Тогда
			ПФ = Новый Структура("Ключ, Документ, Номенклатура, Упаковка, Количество, КоличествоУпаковок, Назначение, НомерСтроки",
								ТД.Серия,
								Объект.Ссылка, 
								ТД.Номенклатура,
								ТД.Упаковка,
								ТД.Количество,
								ТД.КоличествоУпаковок,
								ТД.Назначение,
								ТД.НомерСтроки);	
		Иначе
			СписокСерий = Объект[ИмяТЧСерии].НайтиСтроки(Новый Структура("Номенклатура,Характеристика", ТД.Номенклатура, ТД.Характеристика));
			Если СписокСерий.Количество() = 1 Тогда 
				ПФ = Новый Структура("Ключ, Документ, Номенклатура, Упаковка, Количество, КоличествоУпаковок, Назначение, НомерСтроки",
								СписокСерий[0].Серия,
								Объект.Ссылка, 
								ТД.Номенклатура,
								ТД.Упаковка,
								ТД.Количество, 
								ТД.КоличествоУпаковок,
								ТД.Назначение,
								ТД.НомерСтроки);
			Иначе
				ОткрытьПодборСерий(ИмяТЧ);
			КонецЕсли;
		КонецЕсли;   
	КонецЕсли;
	Если ПФ <> Неопределено Тогда
		ОткрытьФорму("Справочник.СерииНоменклатуры.Форма.бит_ФормаАтрибутыТары", ПФ, ЭтаФорма, УникальныйИдентификатор, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.37]  [VUVaynula@1cbit.ru] [26.05.2025 2:05:37] -
КонецПроцедуры

&НаКлиенте
Процедура бит_СформироватьНаряды(Команда)
	
	Если Объект.бит_Выполнено Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("бит_СформироватьНарядыЗавершение", ЭтотОбъект); 
		
		ПоказатьВопрос(ОписаниеОповещения, "Создать наряды по документу?", РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		Сообщить("Сформировать наряды можно только для документа в статусе ""Выполнено""!");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура бит_СформироватьНарядыЗавершение(РезультатВопроса, СтруктураПараметров) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		бит_СформироватьНарядыНаСервере();	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура бит_СформироватьНарядыНаСервере() 

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПроизводствоБезЗаказа.Ссылка КАК Ссылка,
	|	бит_НарядОперации.Ссылка КАК Наряд
	|ИЗ
	|	Документ.ПроизводствоБезЗаказа КАК ПроизводствоБезЗаказа
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_Наряд.Операции КАК бит_НарядОперации
	|		ПО (бит_НарядОперации.ДокументОснование = ПроизводствоБезЗаказа.Ссылка)
	|ГДЕ
	|	ПроизводствоБезЗаказа.Ссылка = &ПроизводствоБезЗаказа
	|	И ПроизводствоБезЗаказа.Ссылка В
	|			(ВЫБРАТЬ
	|				бит_НарядОперации.ДокументОснование КАК ДокументОснование
	|			ИЗ
	|				Документ.бит_Наряд.Операции КАК бит_НарядОперации
	|			ГДЕ
	|				НЕ бит_НарядОперации.Ссылка.ПометкаУдаления)
	|	И НЕ бит_НарядОперации.Ссылка.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НарядОперации.Ссылка,
	|	ПроизводствоБезЗаказа.Ссылка";
	
	Запрос.УстановитьПараметр("ПроизводствоБезЗаказа", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СообщениеПользователю = Новый СообщениеПользователю; 
		СообщениеПользователю.Текст = "По операции: " + ВыборкаДетальныеЗаписи.Ссылка + " уже создан наряд: " + ВыборкаДетальныеЗаписи.Наряд;
		СообщениеПользователю.КлючДанных = ВыборкаДетальныеЗаписи.Наряд;
		СообщениеПользователю.УстановитьДанные(ВыборкаДетальныеЗаписи.Наряд);
		СообщениеПользователю.Сообщить();
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроизводствоБезЗаказабит_СоставБригады.Ссылка КАК ПроизводственнаяОперация,
		|	ПроизводствоБезЗаказабит_СоставБригады.Сотрудник КАК Сотрудник,
		|	КадроваяИсторияСотрудниковИнтервальный.ДолжностьПоШтатномуРасписанию.Должность КАК ДолжностьСотрудника,
		|	КадроваяИсторияСотрудниковИнтервальный.ДолжностьПоШтатномуРасписанию.РазрядКатегория КАК РазрядСотрудника,
		|	ПроизводствоБезЗаказабит_СоставБригады.Ссылка.бит_Оборудование КАК НаименованиеВРЦ,
		|	ПроизводствоБезЗаказабит_СоставБригады.Должность КАК ДолжностьОперция,
		|	ПроизводствоБезЗаказабит_СоставБригады.Разряд КАК РазрядОперация,
		|	ПроизводствоБезЗаказабит_СоставБригады.КодОперации КАК КодОперации,
		|	ПроизводствоБезЗаказабит_СоставБригады.Начисление КАК Начисление
		|ПОМЕСТИТЬ вт_СотрудникиПоОперации
		|ИЗ
		|	Документ.ПроизводствоБезЗаказа.бит_СоставБригады КАК ПроизводствоБезЗаказабит_СоставБригады
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудниковИнтервальный КАК КадроваяИсторияСотрудниковИнтервальный
		|		ПО ПроизводствоБезЗаказабит_СоставБригады.Сотрудник = КадроваяИсторияСотрудниковИнтервальный.Сотрудник
		|			И (&Дата МЕЖДУ КадроваяИсторияСотрудниковИнтервальный.ДатаНачала И КадроваяИсторияСотрудниковИнтервальный.ДатаОкончания)
		|ГДЕ
		|	НЕ ПроизводствоБезЗаказабит_СоставБригады.Ссылка В
		|				(ВЫБРАТЬ
		|					бит_НарядОперации.ДокументОснование КАК ДокументОснование
		|				ИЗ
		|					Документ.бит_Наряд.Операции КАК бит_НарядОперации
		|				ГДЕ
		|					НЕ бит_НарядОперации.Ссылка.ПометкаУдаления)
		|	И ПроизводствоБезЗаказабит_СоставБригады.Ссылка = &ПроизводствоБезЗаказа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПроизводствоБезЗаказаТрудозатраты.Ссылка КАК ПроизводственнаяОперация,
		|	ПроизводствоБезЗаказаТрудозатраты.ВидРабот КАК ВидРабот,
		|	ПроизводствоБезЗаказаТрудозатраты.ВидРабот.бит_Должность КАК ДолжностьОперации,
		|	ПроизводствоБезЗаказаТрудозатраты.ВидРабот.КвалификационныйРазряд КАК РазрядОперации,
		|	ПроизводствоБезЗаказаТрудозатраты.ВидРабот.Трудоемкость КАК НормоЧасы,
		|	ПроизводствоБезЗаказаТрудозатраты.ВидРабот.бит_РассчитываемоеКоличествоХодов КАК КоличествоХодов,
		|	ПроизводствоБезЗаказаТрудозатраты.ВидРабот.бит_ТехнологическаяСкорость КАК Скорость
		|ПОМЕСТИТЬ вт_ВидыРаботПоОперации
		|ИЗ
		|	Документ.ПроизводствоБезЗаказа.Трудозатраты КАК ПроизводствоБезЗаказаТрудозатраты
		|ГДЕ
		|	ПроизводствоБезЗаказаТрудозатраты.Ссылка В
		|			(ВЫБРАТЬ
		|				вт_СотрудникиПоОперации.ПроизводственнаяОперация КАК ПроизводственнаяОперация
		|			ИЗ
		|				вт_СотрудникиПоОперации КАК вт_СотрудникиПоОперации)
		|	И ПроизводствоБезЗаказаТрудозатраты.Ссылка.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПроизводствоБезЗаказаВыходныеИзделия.Ссылка КАК ПроизводственнаяОперация,
		|	ПроизводствоБезЗаказаВыходныеИзделия.Номенклатура КАК Номенклатура,
		|	ПроизводствоБезЗаказаВыходныеИзделия.Характеристика КАК Характеристика,
		|	СУММА(ПроизводствоБезЗаказаВыходныеИзделия.КоличествоУпаковок) КАК КоличествоФакт,
		|	ПроизводствоБезЗаказаВыходныеИзделия.Упаковка КАК Упаковка
		|ПОМЕСТИТЬ вт_НоменклатураОперации
		|ИЗ
		|	Документ.ПроизводствоБезЗаказа.ВыходныеИзделия КАК ПроизводствоБезЗаказаВыходныеИзделия
		|ГДЕ
		|	ПроизводствоБезЗаказаВыходныеИзделия.Ссылка.Проведен
		|	И ПроизводствоБезЗаказаВыходныеИзделия.Ссылка = &ПроизводствоБезЗаказа
		|
		|СГРУППИРОВАТЬ ПО
		|	ПроизводствоБезЗаказаВыходныеИзделия.Номенклатура,
		|	ПроизводствоБезЗаказаВыходныеИзделия.Ссылка,
		|	ПроизводствоБезЗаказаВыходныеИзделия.Характеристика,
		|	ПроизводствоБезЗаказаВыходныеИзделия.Упаковка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасценкиРаботСотрудниковСрезПоследних.ВидРабот КАК ВидРабот,
		|	РасценкиРаботСотрудниковСрезПоследних.КвалификационныйРазряд КАК КвалификационныйРазряд,
		|	РасценкиРаботСотрудниковСрезПоследних.Расценка КАК Расценка
		|ПОМЕСТИТЬ вт_РасценкиПоОперации
		|ИЗ
		|	РегистрСведений.РасценкиРаботСотрудников.СрезПоследних(
		|			&Дата,
		|			(ВидРабот, КвалификационныйРазряд) В
		|				(ВЫБРАТЬ
		|					вт_ВидыРаботПоОперации.ВидРабот КАК ВидРабот,
		|					вт_ВидыРаботПоОперации.РазрядОперации КАК РазрядОперации
		|				ИЗ
		|					вт_ВидыРаботПоОперации КАК вт_ВидыРаботПоОперации)) КАК РасценкиРаботСотрудниковСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_СотрудникиПоОперации.ПроизводственнаяОперация КАК ДокументОснование,
		|	вт_СотрудникиПоОперации.НаименованиеВРЦ КАК НаименованиеВРЦ,
		|	вт_СотрудникиПоОперации.Сотрудник КАК Сотрудник,
		|	вт_ВидыРаботПоОперации.ВидРабот КАК ВидРабот,
		|	вт_СотрудникиПоОперации.КодОперации КАК НаименованиеОперации,
		|	вт_ВидыРаботПоОперации.ДолжностьОперации КАК ДолжностьОперации,
		|	вт_ВидыРаботПоОперации.РазрядОперации КАК РазрядОперации,
		|	вт_СотрудникиПоОперации.ДолжностьСотрудника КАК ДолжностьСотрудника,
		|	вт_СотрудникиПоОперации.РазрядСотрудника КАК РазрядСотрудника,
		|	вт_НоменклатураОперации.Номенклатура КАК Номенклатура,
		|	вт_НоменклатураОперации.Упаковка КАК ЕдиницаИзмерения,
		|	вт_НоменклатураОперации.КоличествоФакт КАК КоличествоФакт,
		|	вт_РасценкиПоОперации.Расценка КАК Расценка,
		|	вт_РасценкиПоОперации.Расценка * вт_НоменклатураОперации.КоличествоФакт КАК СуммаПоОперации,
		|	вт_ВидыРаботПоОперации.НормоЧасы * вт_НоменклатураОперации.КоличествоФакт КАК НормоЧасы,
		|	вт_ВидыРаботПоОперации.КоличествоХодов КАК КоличествоХодов,
		|	вт_ВидыРаботПоОперации.Скорость КАК Скорость,
		|	вт_СотрудникиПоОперации.Начисление КАК Начисление
		|ИЗ
		|	вт_СотрудникиПоОперации КАК вт_СотрудникиПоОперации
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ВидыРаботПоОперации КАК вт_ВидыРаботПоОперации
		|			ЛЕВОЕ СОЕДИНЕНИЕ вт_РасценкиПоОперации КАК вт_РасценкиПоОперации
		|			ПО вт_ВидыРаботПоОперации.ВидРабот = вт_РасценкиПоОперации.ВидРабот
		|				И вт_ВидыРаботПоОперации.РазрядОперации = вт_РасценкиПоОперации.КвалификационныйРазряд
		|		ПО вт_СотрудникиПоОперации.ПроизводственнаяОперация = вт_ВидыРаботПоОперации.ПроизводственнаяОперация
		|			И вт_СотрудникиПоОперации.КодОперации = вт_ВидыРаботПоОперации.ВидРабот.бит_КодОперации
		|			И вт_СотрудникиПоОперации.ДолжностьОперция = вт_ВидыРаботПоОперации.ДолжностьОперации
		|			И вт_СотрудникиПоОперации.РазрядОперация = вт_ВидыРаботПоОперации.РазрядОперации
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_НоменклатураОперации КАК вт_НоменклатураОперации
		|		ПО вт_СотрудникиПоОперации.ПроизводственнаяОперация = вт_НоменклатураОперации.ПроизводственнаяОперация
		|ИТОГИ ПО
		|	НаименованиеВРЦ,
		|	Сотрудник";
	
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("РабочийЦентр", Объект.бит_Оборудование);
	Запрос.УстановитьПараметр("бит_КодОперации", ?(Объект.бит_Операции.Количество() <> 0, Объект.бит_Операции[0].Операция, Неопределено));
	Запрос.УстановитьПараметр("ПроизводствоБезЗаказа", Объект.Ссылка);                                 
	Запрос.УстановитьПараметр("СтатьяЗП", Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.бит_СтатьиКалькуляцииФОТБезПремии, ЭтотОбъект, Истина).Наименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаВРЦ = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаВРЦ.Следующий() Цикл 
		
		ВыборкаСотрудники = ВыборкаВРЦ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаСотрудники.Следующий() Цикл
			
			ВыборкаДетальныеЗаписи = ВыборкаСотрудники.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			НовыйДокумент = Документы.бит_Наряд.СоздатьДокумент();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				НовыйДокумент.Дата = Объект.Дата;
				НовыйДокумент.Организация = ВыборкаДетальныеЗаписи.ДокументОснование.Организация;
				НовыйДокумент.Подразделение = Объект.Подразделение;
				
				НовыйДокумент.Исполнитель = ВыборкаДетальныеЗаписи.Сотрудник;
				НовыйДокумент.Оборудование  = ВыборкаДетальныеЗаписи.НаименованиеВРЦ;
				//НовыйДокумент.Смена   = Объект.Смена;
				
				НовыйДокумент.ДокументОснование = Объект.Ссылка;
				
				НоваяСтрока = НовыйДокумент.Операции.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
				
				НоваяСтрока.ИдентификаторСтроки = НоваяСтрока.НаименованиеОперации.УникальныйИдентификатор();
					
			КонецЦикла;
			
			ТЗ = НовыйДокумент.Операции.Выгрузить();
			ТЗ.Свернуть("Сотрудник, ДолжностьСотрудника, РазрядСотрудника, ДолжностьОперации, РазрядОперации, НаименованиеОперации, Начисление, НаименованиеВРЦ, ИдентификаторСтроки");
			
			НовыйДокумент.Исполнители.Загрузить(ТЗ);
			
			ЗаполнитьИтоговыеСтроки(НовыйДокумент);
			
			НовыйДокумент.Записать();
			
			СообщениеПользователю = Новый СообщениеПользователю; 
			СообщениеПользователю.Текст = "По Исполнителю: " + ВыборкаДетальныеЗаписи.Сотрудник + " создан новый документ! " + Строка(НовыйДокумент.Ссылка);
			СообщениеПользователю.КлючДанных = НовыйДокумент.Ссылка;
			СообщениеПользователю.УстановитьДанные(НовыйДокумент.Ссылка);
			СообщениеПользователю.Сообщить();
			
		КонецЦикла; 
		
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИтоговыеСтроки(НовыйДокумент)

	ТЗОперация = НовыйДокумент.Операции.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗОперация.Сотрудник КАК Сотрудник,
	|	ТЗОперация.Номенклатура КАК Номенклатура,
	|	ТЗОперация.НаименованиеВРЦ КАК НаименованиеВРЦ,
	|	ТЗОперация.КоличествоХодов КАК КоличествоХодов,
	|	ТЗОперация.КоличествоФакт КАК КоличествоФакт,
	|	ТЗОперация.СуммаПоОперации КАК СуммаПоОперации,
	|	ТЗОперация.НормоЧасы КАК НормоЧасы,
	|	ТЗОперация.ЧасыФакт КАК ЧасыФакт,
	|	ИСТИНА КАК ИтоговаяСтрока
	|ПОМЕСТИТЬ вт_ИтоговыеСтроки
	|ИЗ
	|	&ТЗОперация КАК ТЗОперация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_ИтоговыеСтроки.Сотрудник КАК Сотрудник,
	|	вт_ИтоговыеСтроки.Номенклатура КАК Номенклатура,
	|	вт_ИтоговыеСтроки.НаименованиеВРЦ КАК НаименованиеВРЦ,
	|	вт_ИтоговыеСтроки.КоличествоХодов КАК КоличествоХодов,
	|	СУММА(вт_ИтоговыеСтроки.КоличествоФакт) КАК КоличествоФакт,
	|	СУММА(вт_ИтоговыеСтроки.СуммаПоОперации) КАК СуммаПоОперации,
	|	СУММА(вт_ИтоговыеСтроки.НормоЧасы) КАК НормоЧасы,
	|	СУММА(вт_ИтоговыеСтроки.ЧасыФакт) КАК ЧасыФакт,
	|	вт_ИтоговыеСтроки.ИтоговаяСтрока КАК ИтоговаяСтрока
	|ИЗ
	|	вт_ИтоговыеСтроки КАК вт_ИтоговыеСтроки
	|
	|СГРУППИРОВАТЬ ПО
	|	вт_ИтоговыеСтроки.КоличествоХодов,
	|	вт_ИтоговыеСтроки.ИтоговаяСтрока,
	|	вт_ИтоговыеСтроки.Сотрудник,
	|	вт_ИтоговыеСтроки.НаименованиеВРЦ,
	|	вт_ИтоговыеСтроки.Номенклатура";
	
	Запрос.УстановитьПараметр("ТЗОперация", ТЗОперация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = НовыйДокумент.Операции.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		//НоваяСтрока.Сотрудник = Неопределено;
		//НоваяСтрока.Номенклатура = Неопределено;
		//НоваяСтрока.НаименованиеВРЦ = Неопределено;
		//НоваяСтрока.КоличествоХодов = Неопределено;
		НоваяСтрока.СтрокаИтого = "ИТОГО:";
	КонецЦикла;
	
	НовыйДокумент.Операции.Сортировать("Сотрудник, Номенклатура, НаименованиеВРЦ, КоличествоХодов, ИтоговаяСтрока ВОЗР");
	
КонецПроцедуры


&НаКлиенте
Процедура бит_СоставБригадыСотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.бит_СоставБригады.ТекущиеДанные;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("бит_СоставБригадыСотрудникНачалоВыбораЗавершение", ЭтотОбъект);
	
	ПроизводствоКлиент.ОткрытьФормуВыбораИсполнителя(
	Объект.Организация,
	Объект.Подразделение,
	ТекущиеДанные.Сотрудник,                
	Объект.Дата,
	Истина,
	ОписаниеОповещения);
	
КонецПроцедуры 

&НаКлиенте
Процедура бит_СоставБригадыСотрудникНачалоВыбораЗавершение(Результат, Параметры) Экспорт
	
	ТекущиеДанные = Элементы.бит_СоставБригады.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(Результат) Тогда
		
		ТекущиеДанные.Сотрудник = Результат;
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ИсполнительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		
	ОписаниеОповещения = Новый ОписаниеОповещения("бит_ИсполнительНачалоВыбораЗавершение", ЭтотОбъект);
	
	ПроизводствоКлиент.ОткрытьФормуВыбораИсполнителя(
	Объект.Организация,
	Объект.Подразделение,
	Объект.бит_Исполнитель,                
	Объект.Дата,
	,
	ОписаниеОповещения);
	
КонецПроцедуры 

&НаКлиенте
Процедура бит_ИсполнительНачалоВыбораЗавершение(Результат, Параметры) Экспорт
	
	Если  ЗначениеЗаполнено(Результат) Тогда
		
		Объект.бит_Исполнитель = Результат;
		Модифицированность = Истина;
		
		//Элементы.бит_СтраницаСоставБригады.Видимость = ТипЗнч(Объект.бит_Исполнитель) = Тип("СправочникСсылка.Бригады");
	
		УстановитьИсполнителяВТрудозатратах();
		
		Если ТипЗнч(Объект.бит_Исполнитель) = Тип("СправочникСсылка.Бригады") Тогда
			Объект.бит_СоставБригады.Очистить();	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура бит_СоставБригадыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Не Копирование Тогда

        Элемент.ТекущиеДанные.ЕдиницаИзмерения = ПредопределенноеЗначение("Перечисление.ЕдиницыИзмеренияВремени.Час");

	КонецЕсли;
	
КонецПроцедуры
